<a href="https://colab.research.google.com/github/RedDawe/Titanic_denseNet/blob/master/Decision_Tree.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import os
import numpy as np
import pandas as pd
from scipy.stats import zscore
from sklearn.tree import DecisionTreeClassifier

In [8]:
train = pd.read_csv('train.csv')

In [9]:
train = train.sample(frac=1).reset_index(drop=True)

In [10]:
train.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          703         0       3  ...  14.4542   NaN         C
1          229         0       2  ...  13.0000   NaN         S
2          718         1       2  ...  10.5000  E101         S
3          517         1       2  ...  10.5000   F33         S
4          535         0       3  ...   8.6625   NaN         S
5          291         1       1  ...  78.8500   NaN         S
6          629         0       3  ...   7.8958   NaN         S
7          355         0       3  ...   7.2250   NaN         C
8          698         1       3  ...   7.7333   NaN         Q
9          625         0       3  ...  16.1000   NaN         S

[10 rows x 12 columns]

In [11]:

print(train['Fare'].max())

512.3292

In [12]:
features = ["Pclass", "Sex", "Age", "SibSp", "Parch", "Fare", "Embarked"]
x_train = train[features]

In [13]:
x_train.head(10)

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3  female  18.0      0      1  14.4542        C
1       2    male  18.0      0      0  13.0000        S
2       2  female  27.0      0      0  10.5000        S
3       2  female  34.0      0      0  10.5000        S
4       3  female  30.0      0      0   8.6625        S
5       1  female  26.0      0      0  78.8500        S
6       3    male  26.0      0      0   7.8958        S
7       3    male   NaN      0      0   7.2250        C
8       3  female   NaN      0      0   7.7333        Q
9       3    male  21.0      0      0  16.1000        S

In [14]:
x_train = x_train.replace('male', 0)
x_train = x_train.replace('female', 1)
x_train = x_train.replace('S', 0)
x_train = x_train.replace('C', 1)
x_train = x_train.replace('Q', 2)

In [15]:
x_train = x_train.fillna(0)

In [16]:
x_train.head(10)

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  18.0      0      1  14.4542       1.0
1       2    0  18.0      0      0  13.0000       0.0
2       2    1  27.0      0      0  10.5000       0.0
3       2    1  34.0      0      0  10.5000       0.0
4       3    1  30.0      0      0   8.6625       0.0
5       1    1  26.0      0      0  78.8500       0.0
6       3    0  26.0      0      0   7.8958       0.0
7       3    0   0.0      0      0   7.2250       1.0
8       3    1   0.0      0      0   7.7333       2.0
9       3    0  21.0      0      0  16.1000       0.0

In [17]:
mu = []
sigma = []
for i in range(7):
  mu.append(x_train.iloc[0:800, i].mean())
  sigma.append(x_train.iloc[0:800, i].std())
print(mu)
print(sigma)

[2.31875, 0.35, 23.5877125, 0.54375, 0.38, 31.744853249999984, 0.3575]
[0.8264394655616313, 0.4772679864747315, 17.667624864502468, 1.1433372041760352, 0.8039950310869601, 49.52641456544987, 0.6385165457715464]

In [18]:
x_train = pd.DataFrame((x_train.to_numpy() - np.array(mu))/np.array(sigma))

In [19]:
x_train.head(10)

          0         1         2         3         4         5         6
0  0.824319  1.361918 -0.316268 -0.475581  0.771149 -0.349120  1.006239
1 -0.385691 -0.733341 -0.316268 -0.475581 -0.472640 -0.378482 -0.559892
2 -0.385691  1.361918  0.193138 -0.475581 -0.472640 -0.428960 -0.559892
3 -0.385691  1.361918  0.589343 -0.475581 -0.472640 -0.428960 -0.559892
4  0.824319  1.361918  0.362940 -0.475581 -0.472640 -0.466061 -0.559892
5 -1.595701  1.361918  0.136537 -0.475581 -0.472640  0.951112 -0.559892
6  0.824319 -0.733341  0.136537 -0.475581 -0.472640 -0.481542 -0.559892
7  0.824319 -0.733341 -1.335081 -0.475581 -0.472640 -0.495086  1.006239
8  0.824319  1.361918 -1.335081 -0.475581 -0.472640 -0.484823  2.572369
9  0.824319 -0.733341 -0.146466 -0.475581 -0.472640 -0.315889 -0.559892

In [20]:
y_train = np.array(train['Survived'])
x_train = np.array(x_train)

In [22]:
x_cv = x_train[800:, :]
y_cv = y_train[800:]

x_train = x_train[:800, :]
y_train = y_train[:800]

In [23]:
tree = DecisionTreeClassifier()

In [24]:
tree.fit(x_train, y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [30]:
predictions = tree.predict(x_cv)
predictions

array([1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0,
       1, 1, 0])

In [31]:
np.mean(predictions == y_cv)

0.7802197802197802